import folium
import pandas as pd
import io
from PIL import Image

#i know the code here is horrible
from dotenv import load_dotenv
import os
import sys
load_dotenv()
sys.path.append(os.getenv("MYPATH"))
from telegram_controller import longitude, latitude


if longitude == None and latitude == None:
    longitude = 55.75
    latitude = 37.62
 
m = folium.Map(location=(longitude, latitude), 
               tiles='OpenStreetMap', zoom_start=13)

#location data
data = pd.DataFrame({
    'lon': [55.61173585006371, 55.76807983369603, 55.73888895720566, 55.74158808575795, 55.74723562777022,55.69076515234935, 55.751065046204005, 55.75378412502589, 55.75246276235449, 55.77836041483602, 55.70949960724475, 55.75164495113457, 55.74958078611023, 55.76330380734596, 55.7663002359585, 55.748307870390285, 55.75258928939312, 55.749618105182435, 55.75480412339983, 55.754233086594866, 55.715347433199, 55.75707105338486, 55.749485924681885, 55.72668662603659, 55.76713878841287, 55.73023086691314, 55.771027761011325, 55.749936632170865, 55.744634752060065, 55.75664605690556, 55.734114913791046, 55.73200061147152, 55.76907132822763, 55.76110393209756, 55.754808453078944, 55.74163049825165, 55.77345113801671, 55.761561702317245, 55.78033743955213, 55.78429729782852, 55.79228027549058, 55.694563088136064, 55.68310884229161, 55.67981620967001, 55.7347575197446, 55.734166927820574, 55.729114012319634, 55.77668152972873, 55.77428258000733, 55.771943661011974, 55.758050380096506, 55.7595171733394],
    'lat':[37.68612714001236, 37.59299071053959, 37.52328654966488, 37.62092631821501, 37.605640145564934, 37.56104221302938, 37.61755974713754, 37.61994887070346, 37.613586064310915, 37.63474989584292, 37.54230194001721, 37.628906086045426, 37.62945386885455, 37.576662270704006, 37.6253475201402, 37.538446463308496, 37.62305461118367, 37.6134217705548, 37.621565550834994, 37.62446585536143, 37.60169001666568, 37.62230747070366, 37.59109825351257, 37.55638119890297, 37.571252926526476, 37.49634519895568, 37.609482017496674, 37.541402368854634, 37.5407386840835, 37.640462443966875, 37.623004107892996, 37.63787427393018, 37.596289613402426, 37.61912057539891, 37.5521286287842, 37.609553958774704, 37.65246921490716, 37.583651997690644, 37.570318614882396, 37.70436534002067, 37.763309013034316, 37.54026982652299, 37.50389244001584, 37.478904513028695, 37.40623787070257, 37.426252440018445, 37.445264611182594, 37.62604581118486, 37.599950955362424, 37.587739026526705, 37.60518602652604, 37.66401824518748],
    'name':['Музей-заповедник Царицыно','Государственный музей М.А. Булгакова','Музей-панорама «Бородинская битва»','Третьяковская галерея','Музей изобразительных искусств имени А.С. Пушкина','Дарвиновский музей','Московский кремль','Мавзолей Ленина','Александровский сад','Ботанический сад МГУ «Аптекарский огород»','Воробьевы горы','Парк Зарядье','Парящий мост','Московский зоопарк','Музей советских игровых автоматов','Москва Сити','Храм Василия Блаженного','Оружейная палата','ГУМ','Гостиный Двор','Донской монастырь','Никольская улица','Старый Арбат','Новодевичий монастырь','Собор Непорочного Зачатия Пресвятой Девы Марии','Парк Победы на Поклонной горе','Сад «Эрмитаж»','Народный музей Московского метрополитена','Парк "Набережный"','Евангелическо-лютеранский кафедральный собор Святых Петра и Павла','Музей Тропинина','Театральный музей им. А.А. Бахрушина','Государственный академический театр имени Моссовета','Малый театр','Парк Красная Пресня','Памятник Петру I','Памятник М.Ю Лермонтову','Московский Планетарий','Музей русского импрессионизма','Театр «Дворец на Яузе»','Музей-усадьба «Усадьба Измайлово»','Большой Московский Государственный Цирк','Парк 50-летия Октября','Парк Олимпийской деревни','Храм святого праведного Иоанна Русского','Храм Святой Преподобной Ефросинии Полоцкой','Парк префектуры западного административного округа','Дом-музей В.М. Васнецова','Российский национальный музей музыки','Центральный Дом Кино Союза Кинематографистов РФ','Англиканская церковь Святого Андрея','Музей Эмоций']
}, dtype=str)

#setting markers
for i in range(0, len(data)):
    folium.Marker(
        location = [data.iloc[i]['lon'], data.iloc[i]['lat']],
        popup = data.iloc[i]['name']
    ).add_to(m)

#png
img_data = m._to_png(5)
img = Image.open(io.BytesIO(img_data))

img.save('foliumconf/img.png')
m.save('foliumconf/map.html')


'''
next step is to export all this to telegram bot
'''